tests/gloci/gLoci.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>∇-Glace sans @</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Jean-Sylvain Camier" />
</head>
<body>
<div id="preamble" class="status">
∇-Glace sans @
</div>
<div id="content">
<h1 class="title">∇-Glace sans @</h1>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1">∇-Glace</h2>
<div class="outline-text-2" id="text-orgheadline1">
<div class="org-src-container">

<pre class="src src-nabla"><span style="color: #a52a2a; font-weight: bold;">options</span>{
  <span style="color: #a52a2a; font-weight: bold;">&#8477;</span> &#947; <span style="color: #6a5acd;">=</span> <span style="color: #008b8b;">1.4</span>;
  <span style="color: #a52a2a; font-weight: bold;">&#8477;</span> option_x_min <span style="color: #6a5acd;">=</span> <span style="color: #008b8b;">0.0</span>;
  <span style="color: #a52a2a; font-weight: bold;">&#8477;</span> option_x_interface <span style="color: #6a5acd;">=</span> <span style="color: #008b8b;">0.5</span>;
  <span style="color: #a52a2a; font-weight: bold;">&#8477;</span> option_x_max <span style="color: #6a5acd;">=</span> <span style="color: #008b8b;">1.0</span>;
  <span style="color: #a52a2a; font-weight: bold;">&#8477;</span> option_y_min <span style="color: #6a5acd;">=</span> <span style="color: #008b8b;">0.0</span>;
  <span style="color: #a52a2a; font-weight: bold;">&#8477;</span> option_y_max <span style="color: #6a5acd;">=</span> <span style="color: #008b8b;">4.0</span>;
  <span style="color: #a52a2a; font-weight: bold;">&#8477;</span> option_&#948;t_ini <span style="color: #6a5acd;">=</span> <span style="color: #008b8b;">0.00001</span>;
  <span style="color: #a52a2a; font-weight: bold;">&#8477;</span> option_&#948;t_min <span style="color: #6a5acd;">=</span> 1e<span style="color: #6a5acd;">-</span><span style="color: #008b8b;">12</span>;
  <span style="color: #a52a2a; font-weight: bold;">&#8477;</span> option_&#948;t_max <span style="color: #6a5acd;">=</span> <span style="color: #008b8b;">0.01</span>;
  <span style="color: #a52a2a; font-weight: bold;">&#8477;</span> option_&#948;t_end <span style="color: #6a5acd;">=</span> <span style="color: #008b8b;">0.2</span>;
  <span style="color: #a52a2a; font-weight: bold;">&#8477;</span> option_&#948;t_cfl <span style="color: #6a5acd;">=</span> <span style="color: #008b8b;">0.15</span>;
  <span style="color: #a52a2a; font-weight: bold;">&#8477;</span> option_&#948;t_min_variation <span style="color: #6a5acd;">=</span> <span style="color: #008b8b;">0.99</span>;
  <span style="color: #a52a2a; font-weight: bold;">&#8477;</span> option_&#948;t_max_variation <span style="color: #6a5acd;">=</span> <span style="color: #008b8b;">0.10</span>;
  <span style="color: #a52a2a; font-weight: bold;">&#8510;</span> option_&#948;t_last_exact <span style="color: #6a5acd;">=</span> <span style="color: #008b8b;">true</span>;
  <span style="color: #a52a2a; font-weight: bold;">&#8469;</span> option_max_iterations <span style="color: #6a5acd;">=</span> <span style="color: #008b8b;">32768</span>;
  <span style="color: #a52a2a; font-weight: bold;">&#8477;</span> option_ini_zg_&#961; <span style="color: #6a5acd;">=</span> <span style="color: #008b8b;">1.0</span>;
  <span style="color: #a52a2a; font-weight: bold;">&#8477;</span> option_ini_zd_&#961; <span style="color: #6a5acd;">=</span> <span style="color: #008b8b;">0.125</span>;
  <span style="color: #a52a2a; font-weight: bold;">&#8477;</span> option_ini_zg_p <span style="color: #6a5acd;">=</span> <span style="color: #008b8b;">1.0</span>; 
  <span style="color: #a52a2a; font-weight: bold;">&#8477;</span> option_ini_zd_p <span style="color: #6a5acd;">=</span> <span style="color: #008b8b;">0.1</span>;
};

<span style="color: #a52a2a; font-weight: bold;">variables</span>{
  <span style="color: #a52a2a; font-weight: bold;">&#8477;</span> &#948;t, t;
  <span style="color: #a52a2a; font-weight: bold;">&#8477;</span><span style="color: #000000; font-weight: bold;">&#179;</span> &#935;&#8304;,&#935;;  <span style="color: #2e8b57;">// </span><span style="color: #2e8b57;">Positions noeuds et mailles &#224; t=0 et t&#8319;</span>
  <span style="color: #a52a2a; font-weight: bold;">&#8477;</span><span style="color: #000000; font-weight: bold;">&#179;</span> u,b;   <span style="color: #2e8b57;">// </span><span style="color: #2e8b57;">Vitesses &amp; Second membre</span>

  <span style="color: #a52a2a; font-weight: bold;">&#8477;</span> e,E;    <span style="color: #2e8b57;">// </span><span style="color: #2e8b57;">Energies</span>
  <span style="color: #a52a2a; font-weight: bold;">&#8477;</span> c,m,p&#8304;,p,&#961;&#8304;,&#961;,V&#8304;,V; <span style="color: #2e8b57;">// </span><span style="color: #2e8b57;">Masse, Pression, Densit&#233;s, Volume</span>

  <span style="color: #a52a2a; font-weight: bold;">&#8477;</span><span style="color: #000000; font-weight: bold;">&#179;</span> <span style="color: #6a5acd;">*</span>C,<span style="color: #6a5acd;">*</span>F;  <span style="color: #2e8b57;">// </span><span style="color: #2e8b57;">R&#233;sultantes aux sommets</span>
  <span style="color: #a52a2a; font-weight: bold;">&#8477;</span><span style="color: #000000; font-weight: bold;">&#179;</span>&#10799;<span style="color: #a52a2a; font-weight: bold;">&#8477;</span><span style="color: #000000; font-weight: bold;">&#179;</span> <span style="color: #6a5acd;">*</span>A;  <span style="color: #2e8b57;">// </span><span style="color: #2e8b57;">Matrices de contributions aux sommets</span>
};

<span style="color: #2e8b57;">// </span><span style="color: #2e8b57;">* Conditions initiales: &#935;&#8304;,&#961;&#8304;,p&#8304;,V&#8304; &amp; m</span>
<span style="color: #000000; font-weight: bold;">&#8704;</span> j&#8712;<span style="color: #a52a2a; font-weight: bold;">cells</span> &#935;&#11388; <span style="color: #6a5acd;">=</span> &#188;<span style="color: #6a5acd;">*</span>&#8721;&#7523;&#935;&#8304;&#7523;;
<span style="color: #000000; font-weight: bold;">&#8704;</span> <span style="color: #a52a2a; font-weight: bold;">cells</span> {
  <span style="color: #000000; font-weight: bold;">if</span> (&#935;.x &lt; option_x_interface)){
    &#961;&#8304;<span style="color: #6a5acd;">=</span>option_ini_zg_&#961;;
    p&#8304;<span style="color: #6a5acd;">=</span>option_ini_zg_p;
  }<span style="color: #000000; font-weight: bold;">else</span>{
    &#961;&#8304;<span style="color: #6a5acd;">=</span>option_ini_zd_&#961;;
    p&#8304;<span style="color: #6a5acd;">=</span>option_ini_zd_p;
  }
}
<span style="color: #000000; font-weight: bold;">&#8704;</span> j&#8712;<span style="color: #a52a2a; font-weight: bold;">cells</span> V&#8304;&#11388; <span style="color: #6a5acd;">=</span> &#189;<span style="color: #6a5acd;">*</span>&#8721;&#7523;C&#11388;&#7523;&#8901;&#935;&#8304;&#7523;;
<span style="color: #000000; font-weight: bold;">&#8704;</span> <span style="color: #a52a2a; font-weight: bold;">cells</span> m <span style="color: #6a5acd;">=</span> &#961;&#8304;<span style="color: #6a5acd;">*</span>V&#8304;;

<span style="color: #2e8b57;">// </span><span style="color: #2e8b57;">* Calcul des Cjr</span>
<span style="color: #000000; font-weight: bold;">&#8704;</span> j&#8712;<span style="color: #a52a2a; font-weight: bold;">cells</span>, <span style="color: #000000; font-weight: bold;">&#8704;</span> r&#8712;<span style="color: #a52a2a; font-weight: bold;">nodes</span>(j) C_{jr}<span style="color: #6a5acd;">=</span>&#189;<span style="color: #6a5acd;">*</span>(&#935;_{(j<span style="color: #6a5acd;">-</span><span style="color: #008b8b;">1</span>)%<span style="color: #008b8b;">4</span>}<span style="color: #6a5acd;">-</span>&#935;_{(j<span style="color: #6a5acd;">+</span><span style="color: #008b8b;">1</span>)%<span style="color: #008b8b;">4</span>})&#10178;;

<span style="color: #2e8b57;">// </span><span style="color: #2e8b57;">* R&#232;gles EOS standards</span>
<span style="color: #000000; font-weight: bold;">&#8704;</span> <span style="color: #a52a2a; font-weight: bold;">cells</span> c <span style="color: #6a5acd;">=</span> &#8730;(&#947;<span style="color: #6a5acd;">*</span>p<span style="color: #6a5acd;">/</span>&#961;);
<span style="color: #000000; font-weight: bold;">&#8704;</span> <span style="color: #a52a2a; font-weight: bold;">cells</span> p <span style="color: #6a5acd;">=</span> (&#947;<span style="color: #6a5acd;">-</span><span style="color: #008b8b;">1.0</span>)<span style="color: #6a5acd;">*</span>&#961;<span style="color: #6a5acd;">*</span>e;
<span style="color: #000000; font-weight: bold;">&#8704;</span> <span style="color: #a52a2a; font-weight: bold;">cells</span> &#961; <span style="color: #6a5acd;">=</span> m<span style="color: #6a5acd;">/</span>V;
<span style="color: #000000; font-weight: bold;">&#8704;</span> <span style="color: #a52a2a; font-weight: bold;">cells</span> e <span style="color: #6a5acd;">=</span> E<span style="color: #6a5acd;">-</span>&#189;<span style="color: #6a5acd;">*</span>(u&#8901;u);

<span style="color: #2e8b57;">// </span><span style="color: #2e8b57;">* Init n=0</span>
t&#8319;&#8316;&#8304; <span style="color: #6a5acd;">=</span> <span style="color: #008b8b;">0</span>;
&#948;t&#8319;&#8316;&#8304; <span style="color: #6a5acd;">=</span> option_&#948;t_ini;
<span style="color: #000000; font-weight: bold;">&#8704;</span> <span style="color: #a52a2a; font-weight: bold;">nodes</span> &#935;&#8319;&#8316;&#8304; <span style="color: #6a5acd;">=</span> &#935;&#8304;;
<span style="color: #000000; font-weight: bold;">&#8704;</span> <span style="color: #a52a2a; font-weight: bold;">cells</span> u&#8319;&#8316;&#8304; <span style="color: #6a5acd;">=</span> <span style="color: #008b8b;">0</span>;
<span style="color: #000000; font-weight: bold;">&#8704;</span> <span style="color: #a52a2a; font-weight: bold;">cells</span> E&#8319;&#8316;&#8304; <span style="color: #6a5acd;">=</span> p&#8304;<span style="color: #6a5acd;">/</span>((&#947;<span style="color: #6a5acd;">-</span><span style="color: #008b8b;">1.0</span>)<span style="color: #6a5acd;">*</span>&#961;&#8304;);

<span style="color: #2e8b57;">// </span><span style="color: #2e8b57;">* Cell-centered Godunov Scheme for Lagrangian gas dynamics</span>
<span style="color: #000000; font-weight: bold;">&#8704;</span> j&#8712;<span style="color: #a52a2a; font-weight: bold;">cells</span>, <span style="color: #000000; font-weight: bold;">&#8704;</span> r&#8712;<span style="color: #a52a2a; font-weight: bold;">nodes</span>(j) A&#11388;&#7523; <span style="color: #6a5acd;">=</span> &#961;&#11388;<span style="color: #6a5acd;">*</span>c&#11388;<span style="color: #6a5acd;">*</span>C&#11388;&#7523;&#8855;C&#11388;&#7523;<span style="color: #6a5acd;">/</span>&#8214;C&#11388;&#7523;&#8214;;
<span style="color: #000000; font-weight: bold;">&#8704;</span> r&#8712;<span style="color: #a52a2a; font-weight: bold;">nodes</span> A&#7523; <span style="color: #6a5acd;">=</span> &#8721;&#11388;A&#11388;&#7523;;
<span style="color: #000000; font-weight: bold;">&#8704;</span> r&#8712;<span style="color: #a52a2a; font-weight: bold;">nodes</span> b&#7523; <span style="color: #6a5acd;">=</span> &#8721;<span style="color: #0000cd; font-weight: bold;">&#11388;</span>(A&#11388;&#7523;u&#11388;<span style="color: #6a5acd;">+</span>C&#11388;&#7523;p&#11388;);
<span style="color: #000000; font-weight: bold;">&#8704;</span> r&#8712;<span style="color: #a52a2a; font-weight: bold;">nodes</span> u&#7523; <span style="color: #6a5acd;">=</span> b&#780;&#7523;<span style="color: #6a5acd;">/</span>A&#780;&#7523;;
<span style="color: #000000; font-weight: bold;">&#8704;</span> j&#8712;<span style="color: #a52a2a; font-weight: bold;">cells</span>, <span style="color: #000000; font-weight: bold;">&#8704;</span> r&#8712;<span style="color: #a52a2a; font-weight: bold;">nodes</span>(j), F&#11388;&#7523; <span style="color: #6a5acd;">=</span> p&#11388;<span style="color: #6a5acd;">*</span>C&#11388;&#7523;<span style="color: #6a5acd;">+</span>A&#11388;&#7523;<span style="color: #6a5acd;">*</span>(u&#7523;<span style="color: #6a5acd;">-</span>u&#11388;);

<span style="color: #000000; font-weight: bold;">&#8704;</span> j&#8712;<span style="color: #a52a2a; font-weight: bold;">cells</span> E&#11388;&#8319;&#8314;&#185; <span style="color: #6a5acd;">=</span> E&#11388;&#8319; <span style="color: #6a5acd;">+</span> &#948;t&#8319;<span style="color: #6a5acd;">/</span>m&#11388;&#8319;<span style="color: #6a5acd;">*</span>&#931;&#7523;F&#11388;&#7523;&#8319;;
<span style="color: #000000; font-weight: bold;">&#8704;</span> j&#8712;<span style="color: #a52a2a; font-weight: bold;">cells</span> u&#11388;&#8319;&#8314;&#185; <span style="color: #6a5acd;">=</span> u&#11388;&#8319; <span style="color: #6a5acd;">+</span> &#948;t&#8319;<span style="color: #6a5acd;">/</span>m&#11388;&#8319;<span style="color: #6a5acd;">*</span>&#931;&#7523;F&#11388;&#7523;&#8319;&#8901;u&#7523;&#8319;;
<span style="color: #000000; font-weight: bold;">&#8704;</span> r&#8712;<span style="color: #a52a2a; font-weight: bold;">nodes</span> &#935;&#7523;&#8319;&#8314;&#185; <span style="color: #6a5acd;">=</span> &#935;&#7523;&#8319; <span style="color: #6a5acd;">+</span> &#948;t&#8319;<span style="color: #6a5acd;">*</span>u&#7523;&#8319;;

<span style="color: #000000; font-weight: bold;">&#8704;</span> j&#8712;<span style="color: #a52a2a; font-weight: bold;">cells</span> V&#11388; <span style="color: #6a5acd;">=</span> &#189;<span style="color: #6a5acd;">*</span>&#8721;&#7523;C&#11388;&#7523;&#8901;&#935;&#7523;;

<span style="color: #000000; font-weight: bold;">&#8704;</span> j&#8712;<span style="color: #a52a2a; font-weight: bold;">cells</span> glace_&#948;t&#11388; <span style="color: #6a5acd;">=</span> <span style="color: #008b8b;">2.0</span><span style="color: #6a5acd;">*</span>V&#11388;<span style="color: #6a5acd;">/</span>(c&#11388;<span style="color: #6a5acd;">*</span>&#931;&#7523;&#8214;C&#11388;&#7523;&#8214;);
&#948;t <span style="color: #6a5acd;">=</span> option_&#948;t_cfl<span style="color: #6a5acd;">*</span><span style="color: #0000cd; font-weight: bold;">min&#11388;</span>(glace_&#948;t&#11388;);
t&#8319;&#8314;&#185; <span style="color: #6a5acd;">=</span> t&#8319; <span style="color: #6a5acd;">+</span> &#948;t&#8319;;

<span style="color: #2e8b57;">// </span><span style="color: #2e8b57;">* Boundary conditions</span>
<span style="color: #000000; font-weight: bold;">&#8704;</span> k&#8712;<span style="color: #000000; font-weight: bold;">outer</span> <span style="color: #a52a2a; font-weight: bold;">faces</span>, <span style="color: #000000; font-weight: bold;">&#8704;</span> r&#8712;<span style="color: #a52a2a; font-weight: bold;">nodes</span>(k) {
  b&#771;&#7523; <span style="color: #6a5acd;">=</span> (I<span style="color: #6a5acd;">-</span>n&#8342;&#8855;n&#8342;)<span style="color: #6a5acd;">*</span>b&#7523;;
  A&#771;&#7523; <span style="color: #6a5acd;">=</span> (I<span style="color: #6a5acd;">-</span>n&#8342;&#8855;n&#8342;)<span style="color: #6a5acd;">*</span>A&#7523;<span style="color: #6a5acd;">*</span>(I<span style="color: #6a5acd;">-</span>n&#8342;&#8855;n&#8342;)<span style="color: #6a5acd;">+</span><span style="color: #0000cd; font-weight: bold;">tr</span>(A&#7523;)<span style="color: #6a5acd;">*</span>(I<span style="color: #6a5acd;">-</span>n&#8342;&#8855;n&#8342;);
  <span style="color: #000000; font-weight: bold;">if</span> (!((&#935;&#7523;.x<span style="color: #6a5acd;">==</span>option_x_min)||(&#935;&#7523;.x<span style="color: #6a5acd;">==</span>option_x_max))) <span style="color: #000000; font-weight: bold;">continue</span>;
  A&#780;&#7523;<span style="color: #6a5acd;">=</span>I;
  b&#780;&#7523;<span style="color: #6a5acd;">=</span>option_u_ini;
}
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jean-Sylvain Camier</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
